/* automatically generated by rust-bindgen */

pub const __CM4_REV: ::std::os::raw::c_uint = 1;
pub const __MPU_PRESENT: ::std::os::raw::c_uint = 1;
pub const __NVIC_PRIO_BITS: ::std::os::raw::c_uint = 4;
pub const __Vendor_SysTickConfig: ::std::os::raw::c_uint = 0;
pub const __FPU_PRESENT: ::std::os::raw::c_uint = 1;
pub const _STDINT_H: ::std::os::raw::c_uint = 1;
pub const _FEATURES_H: ::std::os::raw::c_uint = 1;
pub const _DEFAULT_SOURCE: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC11: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC99: ::std::os::raw::c_uint = 1;
pub const __USE_ISOC95: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX_IMPLICITLY: ::std::os::raw::c_uint = 1;
pub const _POSIX_SOURCE: ::std::os::raw::c_uint = 1;
pub const _POSIX_C_SOURCE: ::std::os::raw::c_uint = 200809;
pub const __USE_POSIX: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX2: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX199309: ::std::os::raw::c_uint = 1;
pub const __USE_POSIX199506: ::std::os::raw::c_uint = 1;
pub const __USE_XOPEN2K: ::std::os::raw::c_uint = 1;
pub const __USE_XOPEN2K8: ::std::os::raw::c_uint = 1;
pub const _ATFILE_SOURCE: ::std::os::raw::c_uint = 1;
pub const __USE_MISC: ::std::os::raw::c_uint = 1;
pub const __USE_ATFILE: ::std::os::raw::c_uint = 1;
pub const __USE_FORTIFY_LEVEL: ::std::os::raw::c_uint = 0;
pub const _STDC_PREDEF_H: ::std::os::raw::c_uint = 1;
pub const __STDC_IEC_559__: ::std::os::raw::c_uint = 1;

pub const FLASH_SCALE3_LATENCY2_FREQ: ::std::os::raw::c_uint = 60000000;
#[repr(i32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IRQn_Type {
    NonMaskableInt_IRQn = -14,
    MemoryManagement_IRQn = -12,
    BusFault_IRQn = -11,
    UsageFault_IRQn = -10,
    SVCall_IRQn = -5,
    DebugMonitor_IRQn = -4,
    PendSV_IRQn = -2,
    SysTick_IRQn = -1,
    WWDG_IRQn = 0,
    PVD_IRQn = 1,
    TAMP_STAMP_IRQn = 2,
    RTC_WKUP_IRQn = 3,
    FLASH_IRQn = 4,
    RCC_IRQn = 5,
    EXTI0_IRQn = 6,
    EXTI1_IRQn = 7,
    EXTI2_IRQn = 8,
    EXTI3_IRQn = 9,
    EXTI4_IRQn = 10,
    DMA1_Stream0_IRQn = 11,
    DMA1_Stream1_IRQn = 12,
    DMA1_Stream2_IRQn = 13,
    DMA1_Stream3_IRQn = 14,
    DMA1_Stream4_IRQn = 15,
    DMA1_Stream5_IRQn = 16,
    DMA1_Stream6_IRQn = 17,
    ADC_IRQn = 18,
    EXTI9_5_IRQn = 23,
    TIM1_BRK_TIM9_IRQn = 24,
    TIM1_UP_TIM10_IRQn = 25,
    TIM1_TRG_COM_TIM11_IRQn = 26,
    TIM1_CC_IRQn = 27,
    TIM2_IRQn = 28,
    TIM3_IRQn = 29,
    TIM4_IRQn = 30,
    I2C1_EV_IRQn = 31,
    I2C1_ER_IRQn = 32,
    I2C2_EV_IRQn = 33,
    I2C2_ER_IRQn = 34,
    SPI1_IRQn = 35,
    SPI2_IRQn = 36,
    USART1_IRQn = 37,
    USART2_IRQn = 38,
    EXTI15_10_IRQn = 40,
    RTC_Alarm_IRQn = 41,
    OTG_FS_WKUP_IRQn = 42,
    DMA1_Stream7_IRQn = 47,
    SDIO_IRQn = 49,
    TIM5_IRQn = 50,
    SPI3_IRQn = 51,
    DMA2_Stream0_IRQn = 56,
    DMA2_Stream1_IRQn = 57,
    DMA2_Stream2_IRQn = 58,
    DMA2_Stream3_IRQn = 59,
    DMA2_Stream4_IRQn = 60,
    OTG_FS_IRQn = 67,
    DMA2_Stream5_IRQn = 68,
    DMA2_Stream6_IRQn = 69,
    DMA2_Stream7_IRQn = 70,
    USART6_IRQn = 71,
    I2C3_EV_IRQn = 72,
    I2C3_ER_IRQn = 73,
    FPU_IRQn = 81,
    SPI4_IRQn = 84,
}
pub type int_least8_t = ::std::os::raw::c_char;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_long;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulong;
pub type int_fast8_t = ::std::os::raw::c_char;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy)]
pub union APSR_Type {
    pub b: APSR_Type__bindgen_ty_1,
    pub w: u32,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct APSR_Type__bindgen_ty_1 {
    pub _bitfield_1: [u16; 2usize],
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_APSR_Type__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<APSR_Type__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( APSR_Type__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<APSR_Type__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( APSR_Type__bindgen_ty_1 ) ));
}
impl Clone for APSR_Type__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_APSR_Type() {
    assert_eq!(::core::mem::size_of::<APSR_Type>() , 4usize , concat ! (
               "Size of: " , stringify ! ( APSR_Type ) ));
    assert_eq! (::core::mem::align_of::<APSR_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( APSR_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const APSR_Type ) ) . b as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( APSR_Type ) , "::" ,
                stringify ! ( b ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const APSR_Type ) ) . w as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( APSR_Type ) , "::" ,
                stringify ! ( w ) ));
}
impl Clone for APSR_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union IPSR_Type {
    pub b: IPSR_Type__bindgen_ty_1,
    pub w: u32,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct IPSR_Type__bindgen_ty_1 {
    pub _bitfield_1: u32,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_IPSR_Type__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<IPSR_Type__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( IPSR_Type__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<IPSR_Type__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( IPSR_Type__bindgen_ty_1 ) ));
}
impl Clone for IPSR_Type__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_IPSR_Type() {
    assert_eq!(::core::mem::size_of::<IPSR_Type>() , 4usize , concat ! (
               "Size of: " , stringify ! ( IPSR_Type ) ));
    assert_eq! (::core::mem::align_of::<IPSR_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( IPSR_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IPSR_Type ) ) . b as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IPSR_Type ) , "::" ,
                stringify ! ( b ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IPSR_Type ) ) . w as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IPSR_Type ) , "::" ,
                stringify ! ( w ) ));
}
impl Clone for IPSR_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union xPSR_Type {
    pub b: xPSR_Type__bindgen_ty_1,
    pub w: u32,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xPSR_Type__bindgen_ty_1 {
    pub _bitfield_1: [u16; 2usize],
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_xPSR_Type__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<xPSR_Type__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( xPSR_Type__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<xPSR_Type__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( xPSR_Type__bindgen_ty_1 ) ));
}
impl Clone for xPSR_Type__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_xPSR_Type() {
    assert_eq!(::core::mem::size_of::<xPSR_Type>() , 4usize , concat ! (
               "Size of: " , stringify ! ( xPSR_Type ) ));
    assert_eq! (::core::mem::align_of::<xPSR_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( xPSR_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xPSR_Type ) ) . b as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xPSR_Type ) , "::" ,
                stringify ! ( b ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xPSR_Type ) ) . w as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xPSR_Type ) , "::" ,
                stringify ! ( w ) ));
}
impl Clone for xPSR_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union CONTROL_Type {
    pub b: CONTROL_Type__bindgen_ty_1,
    pub w: u32,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CONTROL_Type__bindgen_ty_1 {
    pub _bitfield_1: u32,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_CONTROL_Type__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<CONTROL_Type__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( CONTROL_Type__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<CONTROL_Type__bindgen_ty_1>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( CONTROL_Type__bindgen_ty_1 )
                ));
}
impl Clone for CONTROL_Type__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_CONTROL_Type() {
    assert_eq!(::core::mem::size_of::<CONTROL_Type>() , 4usize , concat ! (
               "Size of: " , stringify ! ( CONTROL_Type ) ));
    assert_eq! (::core::mem::align_of::<CONTROL_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( CONTROL_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CONTROL_Type ) ) . b as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CONTROL_Type ) , "::" ,
                stringify ! ( b ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CONTROL_Type ) ) . w as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CONTROL_Type ) , "::" ,
                stringify ! ( w ) ));
}
impl Clone for CONTROL_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct NVIC_Type {
    pub ISER: [u32; 8usize],
    pub RESERVED0: [u32; 24usize],
    pub ICER: [u32; 8usize],
    pub RSERVED1: [u32; 24usize],
    pub ISPR: [u32; 8usize],
    pub RESERVED2: [u32; 24usize],
    pub ICPR: [u32; 8usize],
    pub RESERVED3: [u32; 24usize],
    pub IABR: [u32; 8usize],
    pub RESERVED4: [u32; 56usize],
    pub IP: [u8; 240usize],
    pub RESERVED5: [u32; 644usize],
    pub STIR: u32,
}
#[test]
fn bindgen_test_layout_NVIC_Type() {
    assert_eq!(::core::mem::size_of::<NVIC_Type>() , 3588usize , concat ! (
               "Size of: " , stringify ! ( NVIC_Type ) ));
    assert_eq! (::core::mem::align_of::<NVIC_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NVIC_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . ISER as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( ISER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . RESERVED0 as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . ICER as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( ICER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . RSERVED1 as * const _ as
                usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( RSERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . ISPR as * const _ as
                usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( ISPR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . RESERVED2 as * const _ as
                usize } , 288usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . ICPR as * const _ as
                usize } , 384usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( ICPR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . RESERVED3 as * const _ as
                usize } , 416usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . IABR as * const _ as
                usize } , 512usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( IABR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . RESERVED4 as * const _ as
                usize } , 544usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . IP as * const _ as usize
                } , 768usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( IP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . RESERVED5 as * const _ as
                usize } , 1008usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . STIR as * const _ as
                usize } , 3584usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( STIR ) ));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct SCB_Type {
    pub CPUID: u32,
    pub ICSR: u32,
    pub VTOR: u32,
    pub AIRCR: u32,
    pub SCR: u32,
    pub CCR: u32,
    pub SHP: [u8; 12usize],
    pub SHCSR: u32,
    pub CFSR: u32,
    pub HFSR: u32,
    pub DFSR: u32,
    pub MMFAR: u32,
    pub BFAR: u32,
    pub AFSR: u32,
    pub PFR: [u32; 2usize],
    pub DFR: u32,
    pub ADR: u32,
    pub MMFR: [u32; 4usize],
    pub ISAR: [u32; 5usize],
    pub RESERVED0: [u32; 5usize],
    pub CPACR: u32,
}
#[test]
fn bindgen_test_layout_SCB_Type() {
    assert_eq!(::core::mem::size_of::<SCB_Type>() , 140usize , concat ! (
               "Size of: " , stringify ! ( SCB_Type ) ));
    assert_eq! (::core::mem::align_of::<SCB_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( SCB_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . CPUID as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( CPUID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . ICSR as * const _ as usize
                } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( ICSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . VTOR as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( VTOR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . AIRCR as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( AIRCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . SCR as * const _ as usize
                } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( SCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . CCR as * const _ as usize
                } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( CCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . SHP as * const _ as usize
                } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( SHP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . SHCSR as * const _ as
                usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( SHCSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . CFSR as * const _ as usize
                } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( CFSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . HFSR as * const _ as usize
                } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( HFSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . DFSR as * const _ as usize
                } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( DFSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . MMFAR as * const _ as
                usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( MMFAR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . BFAR as * const _ as usize
                } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( BFAR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . AFSR as * const _ as usize
                } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( AFSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . PFR as * const _ as usize
                } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( PFR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . DFR as * const _ as usize
                } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( DFR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . ADR as * const _ as usize
                } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( ADR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . MMFR as * const _ as usize
                } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( MMFR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . ISAR as * const _ as usize
                } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( ISAR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . RESERVED0 as * const _ as
                usize } , 116usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . CPACR as * const _ as
                usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( CPACR ) ));
}
impl Clone for SCB_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct SCnSCB_Type {
    pub RESERVED0: [u32; 1usize],
    pub ICTR: u32,
    pub ACTLR: u32,
}
#[test]
fn bindgen_test_layout_SCnSCB_Type() {
    assert_eq!(::core::mem::size_of::<SCnSCB_Type>() , 12usize , concat ! (
               "Size of: " , stringify ! ( SCnSCB_Type ) ));
    assert_eq! (::core::mem::align_of::<SCnSCB_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( SCnSCB_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCnSCB_Type ) ) . RESERVED0 as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( SCnSCB_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCnSCB_Type ) ) . ICTR as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( SCnSCB_Type ) , "::" ,
                stringify ! ( ICTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCnSCB_Type ) ) . ACTLR as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( SCnSCB_Type ) , "::" ,
                stringify ! ( ACTLR ) ));
}
impl Clone for SCnSCB_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct SysTick_Type {
    pub CTRL: u32,
    pub LOAD: u32,
    pub VAL: u32,
    pub CALIB: u32,
}
#[test]
fn bindgen_test_layout_SysTick_Type() {
    assert_eq!(::core::mem::size_of::<SysTick_Type>() , 16usize , concat ! (
               "Size of: " , stringify ! ( SysTick_Type ) ));
    assert_eq! (::core::mem::align_of::<SysTick_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( SysTick_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SysTick_Type ) ) . CTRL as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( SysTick_Type ) , "::" ,
                stringify ! ( CTRL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SysTick_Type ) ) . LOAD as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( SysTick_Type ) , "::" ,
                stringify ! ( LOAD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SysTick_Type ) ) . VAL as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( SysTick_Type ) , "::" ,
                stringify ! ( VAL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SysTick_Type ) ) . CALIB as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( SysTick_Type ) , "::" ,
                stringify ! ( CALIB ) ));
}
impl Clone for SysTick_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct ITM_Type {
    pub PORT: [ITM_Type__bindgen_ty_1; 32usize],
    pub RESERVED0: [u32; 864usize],
    pub TER: u32,
    pub RESERVED1: [u32; 15usize],
    pub TPR: u32,
    pub RESERVED2: [u32; 15usize],
    pub TCR: u32,
    pub RESERVED3: [u32; 29usize],
    pub IWR: u32,
    pub IRR: u32,
    pub IMCR: u32,
    pub RESERVED4: [u32; 43usize],
    pub LAR: u32,
    pub LSR: u32,
    pub RESERVED5: [u32; 6usize],
    pub PID4: u32,
    pub PID5: u32,
    pub PID6: u32,
    pub PID7: u32,
    pub PID0: u32,
    pub PID1: u32,
    pub PID2: u32,
    pub PID3: u32,
    pub CID0: u32,
    pub CID1: u32,
    pub CID2: u32,
    pub CID3: u32,
}
#[repr(C)]
#[derive(Copy)]
pub union ITM_Type__bindgen_ty_1 {
    pub u8: u8,
    pub u16: u16,
    pub u32: u32,
}
#[test]
fn bindgen_test_layout_ITM_Type__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<ITM_Type__bindgen_ty_1>() , 4usize ,
               concat ! ( "Size of: " , stringify ! ( ITM_Type__bindgen_ty_1 )
               ));
    assert_eq! (::core::mem::align_of::<ITM_Type__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( ITM_Type__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type__bindgen_ty_1 ) ) . u8 as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type__bindgen_ty_1
                ) , "::" , stringify ! ( u8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type__bindgen_ty_1 ) ) . u16 as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type__bindgen_ty_1
                ) , "::" , stringify ! ( u16 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type__bindgen_ty_1 ) ) . u32 as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type__bindgen_ty_1
                ) , "::" , stringify ! ( u32 ) ));
}
impl Clone for ITM_Type__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_ITM_Type() {
    assert_eq!(::core::mem::size_of::<ITM_Type>() , 4096usize , concat ! (
               "Size of: " , stringify ! ( ITM_Type ) ));
    assert_eq! (::core::mem::align_of::<ITM_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( ITM_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . PORT as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( PORT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . RESERVED0 as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . TER as * const _ as usize
                } , 3584usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( TER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . RESERVED1 as * const _ as
                usize } , 3588usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . TPR as * const _ as usize
                } , 3648usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( TPR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . RESERVED2 as * const _ as
                usize } , 3652usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . TCR as * const _ as usize
                } , 3712usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( TCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . RESERVED3 as * const _ as
                usize } , 3716usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . IWR as * const _ as usize
                } , 3832usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( IWR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . IRR as * const _ as usize
                } , 3836usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( IRR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . IMCR as * const _ as usize
                } , 3840usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( IMCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . RESERVED4 as * const _ as
                usize } , 3844usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . LAR as * const _ as usize
                } , 4016usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( LAR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . LSR as * const _ as usize
                } , 4020usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( LSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . RESERVED5 as * const _ as
                usize } , 4024usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . PID4 as * const _ as usize
                } , 4048usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( PID4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . PID5 as * const _ as usize
                } , 4052usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( PID5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . PID6 as * const _ as usize
                } , 4056usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( PID6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . PID7 as * const _ as usize
                } , 4060usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( PID7 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . PID0 as * const _ as usize
                } , 4064usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( PID0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . PID1 as * const _ as usize
                } , 4068usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( PID1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . PID2 as * const _ as usize
                } , 4072usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( PID2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . PID3 as * const _ as usize
                } , 4076usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( PID3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . CID0 as * const _ as usize
                } , 4080usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( CID0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . CID1 as * const _ as usize
                } , 4084usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( CID1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . CID2 as * const _ as usize
                } , 4088usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( CID2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ITM_Type ) ) . CID3 as * const _ as usize
                } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( ITM_Type ) , "::" ,
                stringify ! ( CID3 ) ));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct DWT_Type {
    pub CTRL: u32,
    pub CYCCNT: u32,
    pub CPICNT: u32,
    pub EXCCNT: u32,
    pub SLEEPCNT: u32,
    pub LSUCNT: u32,
    pub FOLDCNT: u32,
    pub PCSR: u32,
    pub COMP0: u32,
    pub MASK0: u32,
    pub FUNCTION0: u32,
    pub RESERVED0: [u32; 1usize],
    pub COMP1: u32,
    pub MASK1: u32,
    pub FUNCTION1: u32,
    pub RESERVED1: [u32; 1usize],
    pub COMP2: u32,
    pub MASK2: u32,
    pub FUNCTION2: u32,
    pub RESERVED2: [u32; 1usize],
    pub COMP3: u32,
    pub MASK3: u32,
    pub FUNCTION3: u32,
}
#[test]
fn bindgen_test_layout_DWT_Type() {
    assert_eq!(::core::mem::size_of::<DWT_Type>() , 92usize , concat ! (
               "Size of: " , stringify ! ( DWT_Type ) ));
    assert_eq! (::core::mem::align_of::<DWT_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( DWT_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . CTRL as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( CTRL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . CYCCNT as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( CYCCNT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . CPICNT as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( CPICNT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . EXCCNT as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( EXCCNT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . SLEEPCNT as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( SLEEPCNT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . LSUCNT as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( LSUCNT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . FOLDCNT as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( FOLDCNT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . PCSR as * const _ as usize
                } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( PCSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . COMP0 as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( COMP0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . MASK0 as * const _ as
                usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( MASK0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . FUNCTION0 as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( FUNCTION0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . RESERVED0 as * const _ as
                usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . COMP1 as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( COMP1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . MASK1 as * const _ as
                usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( MASK1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . FUNCTION1 as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( FUNCTION1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . RESERVED1 as * const _ as
                usize } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . COMP2 as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( COMP2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . MASK2 as * const _ as
                usize } , 68usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( MASK2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . FUNCTION2 as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( FUNCTION2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . RESERVED2 as * const _ as
                usize } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . COMP3 as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( COMP3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . MASK3 as * const _ as
                usize } , 84usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( MASK3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DWT_Type ) ) . FUNCTION3 as * const _ as
                usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( DWT_Type ) , "::" ,
                stringify ! ( FUNCTION3 ) ));
}
impl Clone for DWT_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct TPI_Type {
    pub SSPSR: u32,
    pub CSPSR: u32,
    pub RESERVED0: [u32; 2usize],
    pub ACPR: u32,
    pub RESERVED1: [u32; 55usize],
    pub SPPR: u32,
    pub RESERVED2: [u32; 131usize],
    pub FFSR: u32,
    pub FFCR: u32,
    pub FSCR: u32,
    pub RESERVED3: [u32; 759usize],
    pub TRIGGER: u32,
    pub FIFO0: u32,
    pub ITATBCTR2: u32,
    pub RESERVED4: [u32; 1usize],
    pub ITATBCTR0: u32,
    pub FIFO1: u32,
    pub ITCTRL: u32,
    pub RESERVED5: [u32; 39usize],
    pub CLAIMSET: u32,
    pub CLAIMCLR: u32,
    pub RESERVED7: [u32; 8usize],
    pub DEVID: u32,
    pub DEVTYPE: u32,
}
#[test]
fn bindgen_test_layout_TPI_Type() {
    assert_eq!(::core::mem::size_of::<TPI_Type>() , 4048usize , concat ! (
               "Size of: " , stringify ! ( TPI_Type ) ));
    assert_eq! (::core::mem::align_of::<TPI_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TPI_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . SSPSR as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( SSPSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . CSPSR as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( CSPSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . RESERVED0 as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . ACPR as * const _ as usize
                } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( ACPR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . RESERVED1 as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . SPPR as * const _ as usize
                } , 240usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( SPPR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . RESERVED2 as * const _ as
                usize } , 244usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . FFSR as * const _ as usize
                } , 768usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( FFSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . FFCR as * const _ as usize
                } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( FFCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . FSCR as * const _ as usize
                } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( FSCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . RESERVED3 as * const _ as
                usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . TRIGGER as * const _ as
                usize } , 3816usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( TRIGGER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . FIFO0 as * const _ as
                usize } , 3820usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( FIFO0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . ITATBCTR2 as * const _ as
                usize } , 3824usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( ITATBCTR2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . RESERVED4 as * const _ as
                usize } , 3828usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . ITATBCTR0 as * const _ as
                usize } , 3832usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( ITATBCTR0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . FIFO1 as * const _ as
                usize } , 3836usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( FIFO1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . ITCTRL as * const _ as
                usize } , 3840usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( ITCTRL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . RESERVED5 as * const _ as
                usize } , 3844usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . CLAIMSET as * const _ as
                usize } , 4000usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( CLAIMSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . CLAIMCLR as * const _ as
                usize } , 4004usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( CLAIMCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . RESERVED7 as * const _ as
                usize } , 4008usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( RESERVED7 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . DEVID as * const _ as
                usize } , 4040usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( DEVID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TPI_Type ) ) . DEVTYPE as * const _ as
                usize } , 4044usize , concat ! (
                "Alignment of field: " , stringify ! ( TPI_Type ) , "::" ,
                stringify ! ( DEVTYPE ) ));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct MPU_Type {
    pub TYPE: u32,
    pub CTRL: u32,
    pub RNR: u32,
    pub RBAR: u32,
    pub RASR: u32,
    pub RBAR_A1: u32,
    pub RASR_A1: u32,
    pub RBAR_A2: u32,
    pub RASR_A2: u32,
    pub RBAR_A3: u32,
    pub RASR_A3: u32,
}
#[test]
fn bindgen_test_layout_MPU_Type() {
    assert_eq!(::core::mem::size_of::<MPU_Type>() , 44usize , concat ! (
               "Size of: " , stringify ! ( MPU_Type ) ));
    assert_eq! (::core::mem::align_of::<MPU_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( MPU_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const MPU_Type ) ) . TYPE as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( MPU_Type ) , "::" ,
                stringify ! ( TYPE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const MPU_Type ) ) . CTRL as * const _ as usize
                } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( MPU_Type ) , "::" ,
                stringify ! ( CTRL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const MPU_Type ) ) . RNR as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( MPU_Type ) , "::" ,
                stringify ! ( RNR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const MPU_Type ) ) . RBAR as * const _ as usize
                } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( MPU_Type ) , "::" ,
                stringify ! ( RBAR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const MPU_Type ) ) . RASR as * const _ as usize
                } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( MPU_Type ) , "::" ,
                stringify ! ( RASR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const MPU_Type ) ) . RBAR_A1 as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( MPU_Type ) , "::" ,
                stringify ! ( RBAR_A1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const MPU_Type ) ) . RASR_A1 as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( MPU_Type ) , "::" ,
                stringify ! ( RASR_A1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const MPU_Type ) ) . RBAR_A2 as * const _ as
                usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( MPU_Type ) , "::" ,
                stringify ! ( RBAR_A2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const MPU_Type ) ) . RASR_A2 as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( MPU_Type ) , "::" ,
                stringify ! ( RASR_A2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const MPU_Type ) ) . RBAR_A3 as * const _ as
                usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( MPU_Type ) , "::" ,
                stringify ! ( RBAR_A3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const MPU_Type ) ) . RASR_A3 as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( MPU_Type ) , "::" ,
                stringify ! ( RASR_A3 ) ));
}
impl Clone for MPU_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct FPU_Type {
    pub RESERVED0: [u32; 1usize],
    pub FPCCR: u32,
    pub FPCAR: u32,
    pub FPDSCR: u32,
    pub MVFR0: u32,
    pub MVFR1: u32,
}
#[test]
fn bindgen_test_layout_FPU_Type() {
    assert_eq!(::core::mem::size_of::<FPU_Type>() , 24usize , concat ! (
               "Size of: " , stringify ! ( FPU_Type ) ));
    assert_eq! (::core::mem::align_of::<FPU_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( FPU_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const FPU_Type ) ) . RESERVED0 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( FPU_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const FPU_Type ) ) . FPCCR as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( FPU_Type ) , "::" ,
                stringify ! ( FPCCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const FPU_Type ) ) . FPCAR as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( FPU_Type ) , "::" ,
                stringify ! ( FPCAR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const FPU_Type ) ) . FPDSCR as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( FPU_Type ) , "::" ,
                stringify ! ( FPDSCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const FPU_Type ) ) . MVFR0 as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( FPU_Type ) , "::" ,
                stringify ! ( MVFR0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const FPU_Type ) ) . MVFR1 as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( FPU_Type ) , "::" ,
                stringify ! ( MVFR1 ) ));
}
impl Clone for FPU_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CoreDebug_Type {
    pub DHCSR: u32,
    pub DCRSR: u32,
    pub DCRDR: u32,
    pub DEMCR: u32,
}
#[test]
fn bindgen_test_layout_CoreDebug_Type() {
    assert_eq!(::core::mem::size_of::<CoreDebug_Type>() , 16usize , concat ! (
               "Size of: " , stringify ! ( CoreDebug_Type ) ));
    assert_eq! (::core::mem::align_of::<CoreDebug_Type>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( CoreDebug_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CoreDebug_Type ) ) . DHCSR as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CoreDebug_Type ) , "::"
                , stringify ! ( DHCSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CoreDebug_Type ) ) . DCRSR as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( CoreDebug_Type ) , "::"
                , stringify ! ( DCRSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CoreDebug_Type ) ) . DCRDR as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( CoreDebug_Type ) , "::"
                , stringify ! ( DCRDR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CoreDebug_Type ) ) . DEMCR as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( CoreDebug_Type ) , "::"
                , stringify ! ( DEMCR ) ));
}
impl Clone for CoreDebug_Type {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    #[link_name = "ITM_RxBuffer"]
    pub static mut ITM_RxBuffer: i32;
}
extern "C" {
    #[link_name = "SystemCoreClock"]
    pub static mut SystemCoreClock: u32;
}
extern "C" {
    #[link_name = "AHBPrescTable"]
    pub static mut AHBPrescTable: [u8; 16usize];
}
extern "C" {
    #[link_name = "APBPrescTable"]
    pub static mut APBPrescTable: [u8; 8usize];
}
extern "C" {
    pub fn SystemInit();
}
extern "C" {
    pub fn SystemCoreClockUpdate();
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ADC_TypeDef {
    pub SR: u32,
    pub CR1: u32,
    pub CR2: u32,
    pub SMPR1: u32,
    pub SMPR2: u32,
    pub JOFR1: u32,
    pub JOFR2: u32,
    pub JOFR3: u32,
    pub JOFR4: u32,
    pub HTR: u32,
    pub LTR: u32,
    pub SQR1: u32,
    pub SQR2: u32,
    pub SQR3: u32,
    pub JSQR: u32,
    pub JDR1: u32,
    pub JDR2: u32,
    pub JDR3: u32,
    pub JDR4: u32,
    pub DR: u32,
}
#[test]
fn bindgen_test_layout_ADC_TypeDef() {
    assert_eq!(::core::mem::size_of::<ADC_TypeDef>() , 80usize , concat ! (
               "Size of: " , stringify ! ( ADC_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<ADC_TypeDef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( ADC_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . SR as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( SR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . CR1 as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( CR1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . CR2 as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( CR2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . SMPR1 as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( SMPR1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . SMPR2 as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( SMPR2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . JOFR1 as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( JOFR1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . JOFR2 as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( JOFR2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . JOFR3 as * const _ as
                usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( JOFR3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . JOFR4 as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( JOFR4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . HTR as * const _ as
                usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( HTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . LTR as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( LTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . SQR1 as * const _ as
                usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( SQR1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . SQR2 as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( SQR2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . SQR3 as * const _ as
                usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( SQR3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . JSQR as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( JSQR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . JDR1 as * const _ as
                usize } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( JDR1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . JDR2 as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( JDR2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . JDR3 as * const _ as
                usize } , 68usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( JDR3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . JDR4 as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( JDR4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_TypeDef ) ) . DR as * const _ as
                usize } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_TypeDef ) , "::" ,
                stringify ! ( DR ) ));
}
impl Clone for ADC_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ADC_Common_TypeDef {
    pub CSR: u32,
    pub CCR: u32,
    pub CDR: u32,
}
#[test]
fn bindgen_test_layout_ADC_Common_TypeDef() {
    assert_eq!(::core::mem::size_of::<ADC_Common_TypeDef>() , 12usize , concat
               ! ( "Size of: " , stringify ! ( ADC_Common_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<ADC_Common_TypeDef>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( ADC_Common_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_Common_TypeDef ) ) . CSR as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_Common_TypeDef ) ,
                "::" , stringify ! ( CSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_Common_TypeDef ) ) . CCR as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_Common_TypeDef ) ,
                "::" , stringify ! ( CCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ADC_Common_TypeDef ) ) . CDR as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ADC_Common_TypeDef ) ,
                "::" , stringify ! ( CDR ) ));
}
impl Clone for ADC_Common_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CRC_TypeDef {
    pub DR: u32,
    pub IDR: u8,
    pub RESERVED0: u8,
    pub RESERVED1: u16,
    pub CR: u32,
}
#[test]
fn bindgen_test_layout_CRC_TypeDef() {
    assert_eq!(::core::mem::size_of::<CRC_TypeDef>() , 12usize , concat ! (
               "Size of: " , stringify ! ( CRC_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<CRC_TypeDef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( CRC_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CRC_TypeDef ) ) . DR as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CRC_TypeDef ) , "::" ,
                stringify ! ( DR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CRC_TypeDef ) ) . IDR as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( CRC_TypeDef ) , "::" ,
                stringify ! ( IDR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CRC_TypeDef ) ) . RESERVED0 as * const _
                as usize } , 5usize , concat ! (
                "Alignment of field: " , stringify ! ( CRC_TypeDef ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CRC_TypeDef ) ) . RESERVED1 as * const _
                as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( CRC_TypeDef ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CRC_TypeDef ) ) . CR as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( CRC_TypeDef ) , "::" ,
                stringify ! ( CR ) ));
}
impl Clone for CRC_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct DBGMCU_TypeDef {
    pub IDCODE: u32,
    pub CR: u32,
    pub APB1FZ: u32,
    pub APB2FZ: u32,
}
#[test]
fn bindgen_test_layout_DBGMCU_TypeDef() {
    assert_eq!(::core::mem::size_of::<DBGMCU_TypeDef>() , 16usize , concat ! (
               "Size of: " , stringify ! ( DBGMCU_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<DBGMCU_TypeDef>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( DBGMCU_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DBGMCU_TypeDef ) ) . IDCODE as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( DBGMCU_TypeDef ) , "::"
                , stringify ! ( IDCODE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DBGMCU_TypeDef ) ) . CR as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( DBGMCU_TypeDef ) , "::"
                , stringify ! ( CR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DBGMCU_TypeDef ) ) . APB1FZ as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( DBGMCU_TypeDef ) , "::"
                , stringify ! ( APB1FZ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DBGMCU_TypeDef ) ) . APB2FZ as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( DBGMCU_TypeDef ) , "::"
                , stringify ! ( APB2FZ ) ));
}
impl Clone for DBGMCU_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct DMA_Stream_TypeDef {
    pub CR: u32,
    pub NDTR: u32,
    pub PAR: u32,
    pub M0AR: u32,
    pub M1AR: u32,
    pub FCR: u32,
}
#[test]
fn bindgen_test_layout_DMA_Stream_TypeDef() {
    assert_eq!(::core::mem::size_of::<DMA_Stream_TypeDef>() , 24usize , concat
               ! ( "Size of: " , stringify ! ( DMA_Stream_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<DMA_Stream_TypeDef>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( DMA_Stream_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DMA_Stream_TypeDef ) ) . CR as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( DMA_Stream_TypeDef ) ,
                "::" , stringify ! ( CR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DMA_Stream_TypeDef ) ) . NDTR as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( DMA_Stream_TypeDef ) ,
                "::" , stringify ! ( NDTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DMA_Stream_TypeDef ) ) . PAR as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( DMA_Stream_TypeDef ) ,
                "::" , stringify ! ( PAR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DMA_Stream_TypeDef ) ) . M0AR as * const
                _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( DMA_Stream_TypeDef ) ,
                "::" , stringify ! ( M0AR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DMA_Stream_TypeDef ) ) . M1AR as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( DMA_Stream_TypeDef ) ,
                "::" , stringify ! ( M1AR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DMA_Stream_TypeDef ) ) . FCR as * const _
                as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( DMA_Stream_TypeDef ) ,
                "::" , stringify ! ( FCR ) ));
}
impl Clone for DMA_Stream_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct DMA_TypeDef {
    pub LISR: u32,
    pub HISR: u32,
    pub LIFCR: u32,
    pub HIFCR: u32,
}
#[test]
fn bindgen_test_layout_DMA_TypeDef() {
    assert_eq!(::core::mem::size_of::<DMA_TypeDef>() , 16usize , concat ! (
               "Size of: " , stringify ! ( DMA_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<DMA_TypeDef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( DMA_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DMA_TypeDef ) ) . LISR as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( DMA_TypeDef ) , "::" ,
                stringify ! ( LISR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DMA_TypeDef ) ) . HISR as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( DMA_TypeDef ) , "::" ,
                stringify ! ( HISR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DMA_TypeDef ) ) . LIFCR as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( DMA_TypeDef ) , "::" ,
                stringify ! ( LIFCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const DMA_TypeDef ) ) . HIFCR as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( DMA_TypeDef ) , "::" ,
                stringify ! ( HIFCR ) ));
}
impl Clone for DMA_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct EXTI_TypeDef {
    pub IMR: u32,
    pub EMR: u32,
    pub RTSR: u32,
    pub FTSR: u32,
    pub SWIER: u32,
    pub PR: u32,
}
#[test]
fn bindgen_test_layout_EXTI_TypeDef() {
    assert_eq!(::core::mem::size_of::<EXTI_TypeDef>() , 24usize , concat ! (
               "Size of: " , stringify ! ( EXTI_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<EXTI_TypeDef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( EXTI_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EXTI_TypeDef ) ) . IMR as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( EXTI_TypeDef ) , "::" ,
                stringify ! ( IMR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EXTI_TypeDef ) ) . EMR as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( EXTI_TypeDef ) , "::" ,
                stringify ! ( EMR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EXTI_TypeDef ) ) . RTSR as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( EXTI_TypeDef ) , "::" ,
                stringify ! ( RTSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EXTI_TypeDef ) ) . FTSR as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( EXTI_TypeDef ) , "::" ,
                stringify ! ( FTSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EXTI_TypeDef ) ) . SWIER as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( EXTI_TypeDef ) , "::" ,
                stringify ! ( SWIER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const EXTI_TypeDef ) ) . PR as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( EXTI_TypeDef ) , "::" ,
                stringify ! ( PR ) ));
}
impl Clone for EXTI_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct FLASH_TypeDef {
    pub ACR: u32,
    pub KEYR: u32,
    pub OPTKEYR: u32,
    pub SR: u32,
    pub CR: u32,
    pub OPTCR: u32,
    pub OPTCR1: u32,
}
#[test]
fn bindgen_test_layout_FLASH_TypeDef() {
    assert_eq!(::core::mem::size_of::<FLASH_TypeDef>() , 28usize , concat ! (
               "Size of: " , stringify ! ( FLASH_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<FLASH_TypeDef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( FLASH_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const FLASH_TypeDef ) ) . ACR as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( FLASH_TypeDef ) , "::"
                , stringify ! ( ACR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const FLASH_TypeDef ) ) . KEYR as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( FLASH_TypeDef ) , "::"
                , stringify ! ( KEYR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const FLASH_TypeDef ) ) . OPTKEYR as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( FLASH_TypeDef ) , "::"
                , stringify ! ( OPTKEYR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const FLASH_TypeDef ) ) . SR as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( FLASH_TypeDef ) , "::"
                , stringify ! ( SR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const FLASH_TypeDef ) ) . CR as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( FLASH_TypeDef ) , "::"
                , stringify ! ( CR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const FLASH_TypeDef ) ) . OPTCR as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( FLASH_TypeDef ) , "::"
                , stringify ! ( OPTCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const FLASH_TypeDef ) ) . OPTCR1 as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( FLASH_TypeDef ) , "::"
                , stringify ! ( OPTCR1 ) ));
}
impl Clone for FLASH_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct GPIO_TypeDef {
    pub MODER: u32,
    pub OTYPER: u32,
    pub OSPEEDR: u32,
    pub PUPDR: u32,
    pub IDR: u32,
    pub ODR: u32,
    pub BSRR: u32,
    pub LCKR: u32,
    pub AFR: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_GPIO_TypeDef() {
    assert_eq!(::core::mem::size_of::<GPIO_TypeDef>() , 40usize , concat ! (
               "Size of: " , stringify ! ( GPIO_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<GPIO_TypeDef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( GPIO_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const GPIO_TypeDef ) ) . MODER as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( GPIO_TypeDef ) , "::" ,
                stringify ! ( MODER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const GPIO_TypeDef ) ) . OTYPER as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( GPIO_TypeDef ) , "::" ,
                stringify ! ( OTYPER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const GPIO_TypeDef ) ) . OSPEEDR as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( GPIO_TypeDef ) , "::" ,
                stringify ! ( OSPEEDR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const GPIO_TypeDef ) ) . PUPDR as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( GPIO_TypeDef ) , "::" ,
                stringify ! ( PUPDR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const GPIO_TypeDef ) ) . IDR as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( GPIO_TypeDef ) , "::" ,
                stringify ! ( IDR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const GPIO_TypeDef ) ) . ODR as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( GPIO_TypeDef ) , "::" ,
                stringify ! ( ODR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const GPIO_TypeDef ) ) . BSRR as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( GPIO_TypeDef ) , "::" ,
                stringify ! ( BSRR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const GPIO_TypeDef ) ) . LCKR as * const _ as
                usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( GPIO_TypeDef ) , "::" ,
                stringify ! ( LCKR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const GPIO_TypeDef ) ) . AFR as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( GPIO_TypeDef ) , "::" ,
                stringify ! ( AFR ) ));
}
impl Clone for GPIO_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct SYSCFG_TypeDef {
    pub MEMRMP: u32,
    pub PMC: u32,
    pub EXTICR: [u32; 4usize],
    pub RESERVED: [u32; 2usize],
    pub CMPCR: u32,
}
#[test]
fn bindgen_test_layout_SYSCFG_TypeDef() {
    assert_eq!(::core::mem::size_of::<SYSCFG_TypeDef>() , 36usize , concat ! (
               "Size of: " , stringify ! ( SYSCFG_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<SYSCFG_TypeDef>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( SYSCFG_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SYSCFG_TypeDef ) ) . MEMRMP as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( SYSCFG_TypeDef ) , "::"
                , stringify ! ( MEMRMP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SYSCFG_TypeDef ) ) . PMC as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( SYSCFG_TypeDef ) , "::"
                , stringify ! ( PMC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SYSCFG_TypeDef ) ) . EXTICR as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( SYSCFG_TypeDef ) , "::"
                , stringify ! ( EXTICR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SYSCFG_TypeDef ) ) . RESERVED as * const
                _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( SYSCFG_TypeDef ) , "::"
                , stringify ! ( RESERVED ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SYSCFG_TypeDef ) ) . CMPCR as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( SYSCFG_TypeDef ) , "::"
                , stringify ! ( CMPCR ) ));
}
impl Clone for SYSCFG_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct I2C_TypeDef {
    pub CR1: u32,
    pub CR2: u32,
    pub OAR1: u32,
    pub OAR2: u32,
    pub DR: u32,
    pub SR1: u32,
    pub SR2: u32,
    pub CCR: u32,
    pub TRISE: u32,
    pub FLTR: u32,
}
#[test]
fn bindgen_test_layout_I2C_TypeDef() {
    assert_eq!(::core::mem::size_of::<I2C_TypeDef>() , 40usize , concat ! (
               "Size of: " , stringify ! ( I2C_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<I2C_TypeDef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( I2C_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const I2C_TypeDef ) ) . CR1 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( I2C_TypeDef ) , "::" ,
                stringify ! ( CR1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const I2C_TypeDef ) ) . CR2 as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( I2C_TypeDef ) , "::" ,
                stringify ! ( CR2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const I2C_TypeDef ) ) . OAR1 as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( I2C_TypeDef ) , "::" ,
                stringify ! ( OAR1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const I2C_TypeDef ) ) . OAR2 as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( I2C_TypeDef ) , "::" ,
                stringify ! ( OAR2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const I2C_TypeDef ) ) . DR as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( I2C_TypeDef ) , "::" ,
                stringify ! ( DR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const I2C_TypeDef ) ) . SR1 as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( I2C_TypeDef ) , "::" ,
                stringify ! ( SR1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const I2C_TypeDef ) ) . SR2 as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( I2C_TypeDef ) , "::" ,
                stringify ! ( SR2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const I2C_TypeDef ) ) . CCR as * const _ as
                usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( I2C_TypeDef ) , "::" ,
                stringify ! ( CCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const I2C_TypeDef ) ) . TRISE as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( I2C_TypeDef ) , "::" ,
                stringify ! ( TRISE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const I2C_TypeDef ) ) . FLTR as * const _ as
                usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( I2C_TypeDef ) , "::" ,
                stringify ! ( FLTR ) ));
}
impl Clone for I2C_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct IWDG_TypeDef {
    pub KR: u32,
    pub PR: u32,
    pub RLR: u32,
    pub SR: u32,
}
#[test]
fn bindgen_test_layout_IWDG_TypeDef() {
    assert_eq!(::core::mem::size_of::<IWDG_TypeDef>() , 16usize , concat ! (
               "Size of: " , stringify ! ( IWDG_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<IWDG_TypeDef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( IWDG_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IWDG_TypeDef ) ) . KR as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IWDG_TypeDef ) , "::" ,
                stringify ! ( KR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IWDG_TypeDef ) ) . PR as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( IWDG_TypeDef ) , "::" ,
                stringify ! ( PR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IWDG_TypeDef ) ) . RLR as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( IWDG_TypeDef ) , "::" ,
                stringify ! ( RLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IWDG_TypeDef ) ) . SR as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( IWDG_TypeDef ) , "::" ,
                stringify ! ( SR ) ));
}
impl Clone for IWDG_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct PWR_TypeDef {
    pub CR: u32,
    pub CSR: u32,
}
#[test]
fn bindgen_test_layout_PWR_TypeDef() {
    assert_eq!(::core::mem::size_of::<PWR_TypeDef>() , 8usize , concat ! (
               "Size of: " , stringify ! ( PWR_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<PWR_TypeDef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( PWR_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const PWR_TypeDef ) ) . CR as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( PWR_TypeDef ) , "::" ,
                stringify ! ( CR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const PWR_TypeDef ) ) . CSR as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( PWR_TypeDef ) , "::" ,
                stringify ! ( CSR ) ));
}
impl Clone for PWR_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct RCC_TypeDef {
    pub CR: u32,
    pub PLLCFGR: u32,
    pub CFGR: u32,
    pub CIR: u32,
    pub AHB1RSTR: u32,
    pub AHB2RSTR: u32,
    pub AHB3RSTR: u32,
    pub RESERVED0: u32,
    pub APB1RSTR: u32,
    pub APB2RSTR: u32,
    pub RESERVED1: [u32; 2usize],
    pub AHB1ENR: u32,
    pub AHB2ENR: u32,
    pub AHB3ENR: u32,
    pub RESERVED2: u32,
    pub APB1ENR: u32,
    pub APB2ENR: u32,
    pub RESERVED3: [u32; 2usize],
    pub AHB1LPENR: u32,
    pub AHB2LPENR: u32,
    pub AHB3LPENR: u32,
    pub RESERVED4: u32,
    pub APB1LPENR: u32,
    pub APB2LPENR: u32,
    pub RESERVED5: [u32; 2usize],
    pub BDCR: u32,
    pub CSR: u32,
    pub RESERVED6: [u32; 2usize],
    pub SSCGR: u32,
    pub PLLI2SCFGR: u32,
    pub RESERVED7: [u32; 1usize],
    pub DCKCFGR: u32,
}
#[test]
fn bindgen_test_layout_RCC_TypeDef() {
    assert_eq!(::core::mem::size_of::<RCC_TypeDef>() , 144usize , concat ! (
               "Size of: " , stringify ! ( RCC_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<RCC_TypeDef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( RCC_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . CR as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( CR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . PLLCFGR as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( PLLCFGR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . CFGR as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( CFGR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . CIR as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( CIR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . AHB1RSTR as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( AHB1RSTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . AHB2RSTR as * const _
                as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( AHB2RSTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . AHB3RSTR as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( AHB3RSTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . RESERVED0 as * const _
                as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . APB1RSTR as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( APB1RSTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . APB2RSTR as * const _
                as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( APB2RSTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . RESERVED1 as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . AHB1ENR as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( AHB1ENR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . AHB2ENR as * const _ as
                usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( AHB2ENR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . AHB3ENR as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( AHB3ENR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . RESERVED2 as * const _
                as usize } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . APB1ENR as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( APB1ENR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . APB2ENR as * const _ as
                usize } , 68usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( APB2ENR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . RESERVED3 as * const _
                as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . AHB1LPENR as * const _
                as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( AHB1LPENR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . AHB2LPENR as * const _
                as usize } , 84usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( AHB2LPENR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . AHB3LPENR as * const _
                as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( AHB3LPENR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . RESERVED4 as * const _
                as usize } , 92usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . APB1LPENR as * const _
                as usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( APB1LPENR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . APB2LPENR as * const _
                as usize } , 100usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( APB2LPENR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . RESERVED5 as * const _
                as usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . BDCR as * const _ as
                usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( BDCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . CSR as * const _ as
                usize } , 116usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( CSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . RESERVED6 as * const _
                as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( RESERVED6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . SSCGR as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( SSCGR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . PLLI2SCFGR as * const _
                as usize } , 132usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( PLLI2SCFGR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . RESERVED7 as * const _
                as usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( RESERVED7 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RCC_TypeDef ) ) . DCKCFGR as * const _ as
                usize } , 140usize , concat ! (
                "Alignment of field: " , stringify ! ( RCC_TypeDef ) , "::" ,
                stringify ! ( DCKCFGR ) ));
}
impl Clone for RCC_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct RTC_TypeDef {
    pub TR: u32,
    pub DR: u32,
    pub CR: u32,
    pub ISR: u32,
    pub PRER: u32,
    pub WUTR: u32,
    pub CALIBR: u32,
    pub ALRMAR: u32,
    pub ALRMBR: u32,
    pub WPR: u32,
    pub SSR: u32,
    pub SHIFTR: u32,
    pub TSTR: u32,
    pub TSDR: u32,
    pub TSSSR: u32,
    pub CALR: u32,
    pub TAFCR: u32,
    pub ALRMASSR: u32,
    pub ALRMBSSR: u32,
    pub RESERVED7: u32,
    pub BKP0R: u32,
    pub BKP1R: u32,
    pub BKP2R: u32,
    pub BKP3R: u32,
    pub BKP4R: u32,
    pub BKP5R: u32,
    pub BKP6R: u32,
    pub BKP7R: u32,
    pub BKP8R: u32,
    pub BKP9R: u32,
    pub BKP10R: u32,
    pub BKP11R: u32,
    pub BKP12R: u32,
    pub BKP13R: u32,
    pub BKP14R: u32,
    pub BKP15R: u32,
    pub BKP16R: u32,
    pub BKP17R: u32,
    pub BKP18R: u32,
    pub BKP19R: u32,
}
#[test]
fn bindgen_test_layout_RTC_TypeDef() {
    assert_eq!(::core::mem::size_of::<RTC_TypeDef>() , 160usize , concat ! (
               "Size of: " , stringify ! ( RTC_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<RTC_TypeDef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( RTC_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . TR as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( TR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . DR as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( DR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . CR as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( CR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . ISR as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( ISR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . PRER as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( PRER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . WUTR as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( WUTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . CALIBR as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( CALIBR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . ALRMAR as * const _ as
                usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( ALRMAR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . ALRMBR as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( ALRMBR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . WPR as * const _ as
                usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( WPR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . SSR as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( SSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . SHIFTR as * const _ as
                usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( SHIFTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . TSTR as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( TSTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . TSDR as * const _ as
                usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( TSDR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . TSSSR as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( TSSSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . CALR as * const _ as
                usize } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( CALR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . TAFCR as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( TAFCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . ALRMASSR as * const _
                as usize } , 68usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( ALRMASSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . ALRMBSSR as * const _
                as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( ALRMBSSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . RESERVED7 as * const _
                as usize } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( RESERVED7 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP0R as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP0R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP1R as * const _ as
                usize } , 84usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP1R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP2R as * const _ as
                usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP2R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP3R as * const _ as
                usize } , 92usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP3R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP4R as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP4R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP5R as * const _ as
                usize } , 100usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP5R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP6R as * const _ as
                usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP6R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP7R as * const _ as
                usize } , 108usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP7R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP8R as * const _ as
                usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP8R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP9R as * const _ as
                usize } , 116usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP9R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP10R as * const _ as
                usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP10R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP11R as * const _ as
                usize } , 124usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP11R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP12R as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP12R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP13R as * const _ as
                usize } , 132usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP13R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP14R as * const _ as
                usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP14R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP15R as * const _ as
                usize } , 140usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP15R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP16R as * const _ as
                usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP16R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP17R as * const _ as
                usize } , 148usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP17R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP18R as * const _ as
                usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP18R ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const RTC_TypeDef ) ) . BKP19R as * const _ as
                usize } , 156usize , concat ! (
                "Alignment of field: " , stringify ! ( RTC_TypeDef ) , "::" ,
                stringify ! ( BKP19R ) ));
}
impl Clone for RTC_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct SDIO_TypeDef {
    pub POWER: u32,
    pub CLKCR: u32,
    pub ARG: u32,
    pub CMD: u32,
    pub RESPCMD: u32,
    pub RESP1: u32,
    pub RESP2: u32,
    pub RESP3: u32,
    pub RESP4: u32,
    pub DTIMER: u32,
    pub DLEN: u32,
    pub DCTRL: u32,
    pub DCOUNT: u32,
    pub STA: u32,
    pub ICR: u32,
    pub MASK: u32,
    pub RESERVED0: [u32; 2usize],
    pub FIFOCNT: u32,
    pub RESERVED1: [u32; 13usize],
    pub FIFO: u32,
}
#[test]
fn bindgen_test_layout_SDIO_TypeDef() {
    assert_eq!(::core::mem::size_of::<SDIO_TypeDef>() , 132usize , concat ! (
               "Size of: " , stringify ! ( SDIO_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<SDIO_TypeDef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( SDIO_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . POWER as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( POWER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . CLKCR as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( CLKCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . ARG as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( ARG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . CMD as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( CMD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . RESPCMD as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( RESPCMD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . RESP1 as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( RESP1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . RESP2 as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( RESP2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . RESP3 as * const _ as
                usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( RESP3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . RESP4 as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( RESP4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . DTIMER as * const _ as
                usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( DTIMER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . DLEN as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( DLEN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . DCTRL as * const _ as
                usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( DCTRL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . DCOUNT as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( DCOUNT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . STA as * const _ as
                usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( STA ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . ICR as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( ICR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . MASK as * const _ as
                usize } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( MASK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . RESERVED0 as * const _
                as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . FIFOCNT as * const _
                as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( FIFOCNT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . RESERVED1 as * const _
                as usize } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SDIO_TypeDef ) ) . FIFO as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( SDIO_TypeDef ) , "::" ,
                stringify ! ( FIFO ) ));
}
impl Clone for SDIO_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct SPI_TypeDef {
    pub CR1: u32,
    pub CR2: u32,
    pub SR: u32,
    pub DR: u32,
    pub CRCPR: u32,
    pub RXCRCR: u32,
    pub TXCRCR: u32,
    pub I2SCFGR: u32,
    pub I2SPR: u32,
}
#[test]
fn bindgen_test_layout_SPI_TypeDef() {
    assert_eq!(::core::mem::size_of::<SPI_TypeDef>() , 36usize , concat ! (
               "Size of: " , stringify ! ( SPI_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<SPI_TypeDef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( SPI_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SPI_TypeDef ) ) . CR1 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( SPI_TypeDef ) , "::" ,
                stringify ! ( CR1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SPI_TypeDef ) ) . CR2 as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( SPI_TypeDef ) , "::" ,
                stringify ! ( CR2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SPI_TypeDef ) ) . SR as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( SPI_TypeDef ) , "::" ,
                stringify ! ( SR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SPI_TypeDef ) ) . DR as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( SPI_TypeDef ) , "::" ,
                stringify ! ( DR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SPI_TypeDef ) ) . CRCPR as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( SPI_TypeDef ) , "::" ,
                stringify ! ( CRCPR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SPI_TypeDef ) ) . RXCRCR as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( SPI_TypeDef ) , "::" ,
                stringify ! ( RXCRCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SPI_TypeDef ) ) . TXCRCR as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( SPI_TypeDef ) , "::" ,
                stringify ! ( TXCRCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SPI_TypeDef ) ) . I2SCFGR as * const _ as
                usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( SPI_TypeDef ) , "::" ,
                stringify ! ( I2SCFGR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SPI_TypeDef ) ) . I2SPR as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( SPI_TypeDef ) , "::" ,
                stringify ! ( I2SPR ) ));
}
impl Clone for SPI_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct TIM_TypeDef {
    pub CR1: u32,
    pub CR2: u32,
    pub SMCR: u32,
    pub DIER: u32,
    pub SR: u32,
    pub EGR: u32,
    pub CCMR1: u32,
    pub CCMR2: u32,
    pub CCER: u32,
    pub CNT: u32,
    pub PSC: u32,
    pub ARR: u32,
    pub RCR: u32,
    pub CCR1: u32,
    pub CCR2: u32,
    pub CCR3: u32,
    pub CCR4: u32,
    pub BDTR: u32,
    pub DCR: u32,
    pub DMAR: u32,
    pub OR: u32,
}
#[test]
fn bindgen_test_layout_TIM_TypeDef() {
    assert_eq!(::core::mem::size_of::<TIM_TypeDef>() , 84usize , concat ! (
               "Size of: " , stringify ! ( TIM_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<TIM_TypeDef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( TIM_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . CR1 as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( CR1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . CR2 as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( CR2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . SMCR as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( SMCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . DIER as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( DIER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . SR as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( SR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . EGR as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( EGR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . CCMR1 as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( CCMR1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . CCMR2 as * const _ as
                usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( CCMR2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . CCER as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( CCER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . CNT as * const _ as
                usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( CNT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . PSC as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( PSC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . ARR as * const _ as
                usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( ARR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . RCR as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( RCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . CCR1 as * const _ as
                usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( CCR1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . CCR2 as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( CCR2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . CCR3 as * const _ as
                usize } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( CCR3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . CCR4 as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( CCR4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . BDTR as * const _ as
                usize } , 68usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( BDTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . DCR as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( DCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . DMAR as * const _ as
                usize } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( DMAR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const TIM_TypeDef ) ) . OR as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( TIM_TypeDef ) , "::" ,
                stringify ! ( OR ) ));
}
impl Clone for TIM_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct USART_TypeDef {
    pub SR: u32,
    pub DR: u32,
    pub BRR: u32,
    pub CR1: u32,
    pub CR2: u32,
    pub CR3: u32,
    pub GTPR: u32,
}
#[test]
fn bindgen_test_layout_USART_TypeDef() {
    assert_eq!(::core::mem::size_of::<USART_TypeDef>() , 28usize , concat ! (
               "Size of: " , stringify ! ( USART_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<USART_TypeDef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( USART_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USART_TypeDef ) ) . SR as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( USART_TypeDef ) , "::"
                , stringify ! ( SR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USART_TypeDef ) ) . DR as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( USART_TypeDef ) , "::"
                , stringify ! ( DR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USART_TypeDef ) ) . BRR as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( USART_TypeDef ) , "::"
                , stringify ! ( BRR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USART_TypeDef ) ) . CR1 as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( USART_TypeDef ) , "::"
                , stringify ! ( CR1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USART_TypeDef ) ) . CR2 as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( USART_TypeDef ) , "::"
                , stringify ! ( CR2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USART_TypeDef ) ) . CR3 as * const _ as
                usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( USART_TypeDef ) , "::"
                , stringify ! ( CR3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USART_TypeDef ) ) . GTPR as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( USART_TypeDef ) , "::"
                , stringify ! ( GTPR ) ));
}
impl Clone for USART_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct WWDG_TypeDef {
    pub CR: u32,
    pub CFR: u32,
    pub SR: u32,
}
#[test]
fn bindgen_test_layout_WWDG_TypeDef() {
    assert_eq!(::core::mem::size_of::<WWDG_TypeDef>() , 12usize , concat ! (
               "Size of: " , stringify ! ( WWDG_TypeDef ) ));
    assert_eq! (::core::mem::align_of::<WWDG_TypeDef>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( WWDG_TypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const WWDG_TypeDef ) ) . CR as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( WWDG_TypeDef ) , "::" ,
                stringify ! ( CR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const WWDG_TypeDef ) ) . CFR as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( WWDG_TypeDef ) , "::" ,
                stringify ! ( CFR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const WWDG_TypeDef ) ) . SR as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( WWDG_TypeDef ) , "::" ,
                stringify ! ( SR ) ));
}
impl Clone for WWDG_TypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct USB_OTG_GlobalTypeDef {
    pub GOTGCTL: u32,
    pub GOTGINT: u32,
    pub GAHBCFG: u32,
    pub GUSBCFG: u32,
    pub GRSTCTL: u32,
    pub GINTSTS: u32,
    pub GINTMSK: u32,
    pub GRXSTSR: u32,
    pub GRXSTSP: u32,
    pub GRXFSIZ: u32,
    pub DIEPTXF0_HNPTXFSIZ: u32,
    pub HNPTXSTS: u32,
    pub Reserved30: [u32; 2usize],
    pub GCCFG: u32,
    pub CID: u32,
    pub Reserved40: [u32; 48usize],
    pub HPTXFSIZ: u32,
    pub DIEPTXF: [u32; 15usize],
}
#[test]
fn bindgen_test_layout_USB_OTG_GlobalTypeDef() {
    assert_eq!(::core::mem::size_of::<USB_OTG_GlobalTypeDef>() , 320usize ,
               concat ! ( "Size of: " , stringify ! ( USB_OTG_GlobalTypeDef )
               ));
    assert_eq! (::core::mem::align_of::<USB_OTG_GlobalTypeDef>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( USB_OTG_GlobalTypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . GOTGCTL as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( GOTGCTL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . GOTGINT as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( GOTGINT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . GAHBCFG as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( GAHBCFG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . GUSBCFG as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( GUSBCFG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . GRSTCTL as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( GRSTCTL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . GINTSTS as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( GINTSTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . GINTMSK as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( GINTMSK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . GRXSTSR as *
                const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( GRXSTSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . GRXSTSP as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( GRXSTSP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . GRXFSIZ as *
                const _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( GRXFSIZ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) .
                DIEPTXF0_HNPTXFSIZ as * const _ as usize } , 40usize , concat
                ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( DIEPTXF0_HNPTXFSIZ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . HNPTXSTS as *
                const _ as usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( HNPTXSTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . Reserved30 as
                * const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( Reserved30 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . GCCFG as *
                const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( GCCFG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . CID as *
                const _ as usize } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( CID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . Reserved40 as
                * const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( Reserved40 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . HPTXFSIZ as *
                const _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( HPTXFSIZ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_GlobalTypeDef ) ) . DIEPTXF as *
                const _ as usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_GlobalTypeDef )
                , "::" , stringify ! ( DIEPTXF ) ));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct USB_OTG_DeviceTypeDef {
    pub DCFG: u32,
    pub DCTL: u32,
    pub DSTS: u32,
    pub Reserved0C: u32,
    pub DIEPMSK: u32,
    pub DOEPMSK: u32,
    pub DAINT: u32,
    pub DAINTMSK: u32,
    pub Reserved20: u32,
    pub Reserved9: u32,
    pub DVBUSDIS: u32,
    pub DVBUSPULSE: u32,
    pub DTHRCTL: u32,
    pub DIEPEMPMSK: u32,
    pub DEACHINT: u32,
    pub DEACHMSK: u32,
    pub Reserved40: u32,
    pub DINEP1MSK: u32,
    pub Reserved44: [u32; 15usize],
    pub DOUTEP1MSK: u32,
}
#[test]
fn bindgen_test_layout_USB_OTG_DeviceTypeDef() {
    assert_eq!(::core::mem::size_of::<USB_OTG_DeviceTypeDef>() , 136usize ,
               concat ! ( "Size of: " , stringify ! ( USB_OTG_DeviceTypeDef )
               ));
    assert_eq! (::core::mem::align_of::<USB_OTG_DeviceTypeDef>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( USB_OTG_DeviceTypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . DCFG as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( DCFG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . DCTL as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( DCTL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . DSTS as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( DSTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . Reserved0C as
                * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( Reserved0C ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . DIEPMSK as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( DIEPMSK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . DOEPMSK as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( DOEPMSK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . DAINT as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( DAINT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . DAINTMSK as *
                const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( DAINTMSK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . Reserved20 as
                * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( Reserved20 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . Reserved9 as
                * const _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( Reserved9 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . DVBUSDIS as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( DVBUSDIS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . DVBUSPULSE as
                * const _ as usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( DVBUSPULSE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . DTHRCTL as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( DTHRCTL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . DIEPEMPMSK as
                * const _ as usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( DIEPEMPMSK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . DEACHINT as *
                const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( DEACHINT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . DEACHMSK as *
                const _ as usize } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( DEACHMSK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . Reserved40 as
                * const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( Reserved40 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . DINEP1MSK as
                * const _ as usize } , 68usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( DINEP1MSK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . Reserved44 as
                * const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( Reserved44 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_DeviceTypeDef ) ) . DOUTEP1MSK as
                * const _ as usize } , 132usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_DeviceTypeDef )
                , "::" , stringify ! ( DOUTEP1MSK ) ));
}
impl Clone for USB_OTG_DeviceTypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct USB_OTG_INEndpointTypeDef {
    pub DIEPCTL: u32,
    pub Reserved04: u32,
    pub DIEPINT: u32,
    pub Reserved0C: u32,
    pub DIEPTSIZ: u32,
    pub DIEPDMA: u32,
    pub DTXFSTS: u32,
    pub Reserved18: u32,
}
#[test]
fn bindgen_test_layout_USB_OTG_INEndpointTypeDef() {
    assert_eq!(::core::mem::size_of::<USB_OTG_INEndpointTypeDef>() , 32usize ,
               concat ! (
               "Size of: " , stringify ! ( USB_OTG_INEndpointTypeDef ) ));
    assert_eq! (::core::mem::align_of::<USB_OTG_INEndpointTypeDef>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( USB_OTG_INEndpointTypeDef )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_INEndpointTypeDef ) ) . DIEPCTL
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_INEndpointTypeDef ) , "::" , stringify ! ( DIEPCTL )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_INEndpointTypeDef ) ) .
                Reserved04 as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_INEndpointTypeDef ) , "::" , stringify ! ( Reserved04
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_INEndpointTypeDef ) ) . DIEPINT
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_INEndpointTypeDef ) , "::" , stringify ! ( DIEPINT )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_INEndpointTypeDef ) ) .
                Reserved0C as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_INEndpointTypeDef ) , "::" , stringify ! ( Reserved0C
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_INEndpointTypeDef ) ) . DIEPTSIZ
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_INEndpointTypeDef ) , "::" , stringify ! ( DIEPTSIZ )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_INEndpointTypeDef ) ) . DIEPDMA
                as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_INEndpointTypeDef ) , "::" , stringify ! ( DIEPDMA )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_INEndpointTypeDef ) ) . DTXFSTS
                as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_INEndpointTypeDef ) , "::" , stringify ! ( DTXFSTS )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_INEndpointTypeDef ) ) .
                Reserved18 as * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_INEndpointTypeDef ) , "::" , stringify ! ( Reserved18
                ) ));
}
impl Clone for USB_OTG_INEndpointTypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct USB_OTG_OUTEndpointTypeDef {
    pub DOEPCTL: u32,
    pub Reserved04: u32,
    pub DOEPINT: u32,
    pub Reserved0C: u32,
    pub DOEPTSIZ: u32,
    pub DOEPDMA: u32,
    pub Reserved18: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_USB_OTG_OUTEndpointTypeDef() {
    assert_eq!(::core::mem::size_of::<USB_OTG_OUTEndpointTypeDef>() , 32usize
               , concat ! (
               "Size of: " , stringify ! ( USB_OTG_OUTEndpointTypeDef ) ));
    assert_eq! (::core::mem::align_of::<USB_OTG_OUTEndpointTypeDef>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( USB_OTG_OUTEndpointTypeDef )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_OUTEndpointTypeDef ) ) . DOEPCTL
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_OUTEndpointTypeDef ) , "::" , stringify ! ( DOEPCTL )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_OUTEndpointTypeDef ) ) .
                Reserved04 as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_OUTEndpointTypeDef ) , "::" , stringify ! ( Reserved04
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_OUTEndpointTypeDef ) ) . DOEPINT
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_OUTEndpointTypeDef ) , "::" , stringify ! ( DOEPINT )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_OUTEndpointTypeDef ) ) .
                Reserved0C as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_OUTEndpointTypeDef ) , "::" , stringify ! ( Reserved0C
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_OUTEndpointTypeDef ) ) . DOEPTSIZ
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_OUTEndpointTypeDef ) , "::" , stringify ! ( DOEPTSIZ )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_OUTEndpointTypeDef ) ) . DOEPDMA
                as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_OUTEndpointTypeDef ) , "::" , stringify ! ( DOEPDMA )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_OUTEndpointTypeDef ) ) .
                Reserved18 as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_OUTEndpointTypeDef ) , "::" , stringify ! ( Reserved18
                ) ));
}
impl Clone for USB_OTG_OUTEndpointTypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct USB_OTG_HostTypeDef {
    pub HCFG: u32,
    pub HFIR: u32,
    pub HFNUM: u32,
    pub Reserved40C: u32,
    pub HPTXSTS: u32,
    pub HAINT: u32,
    pub HAINTMSK: u32,
}
#[test]
fn bindgen_test_layout_USB_OTG_HostTypeDef() {
    assert_eq!(::core::mem::size_of::<USB_OTG_HostTypeDef>() , 28usize ,
               concat ! ( "Size of: " , stringify ! ( USB_OTG_HostTypeDef )
               ));
    assert_eq! (::core::mem::align_of::<USB_OTG_HostTypeDef>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( USB_OTG_HostTypeDef ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_HostTypeDef ) ) . HCFG as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_HostTypeDef ) ,
                "::" , stringify ! ( HCFG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_HostTypeDef ) ) . HFIR as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_HostTypeDef ) ,
                "::" , stringify ! ( HFIR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_HostTypeDef ) ) . HFNUM as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_HostTypeDef ) ,
                "::" , stringify ! ( HFNUM ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_HostTypeDef ) ) . Reserved40C as
                * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_HostTypeDef ) ,
                "::" , stringify ! ( Reserved40C ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_HostTypeDef ) ) . HPTXSTS as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_HostTypeDef ) ,
                "::" , stringify ! ( HPTXSTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_HostTypeDef ) ) . HAINT as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_HostTypeDef ) ,
                "::" , stringify ! ( HAINT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_HostTypeDef ) ) . HAINTMSK as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( USB_OTG_HostTypeDef ) ,
                "::" , stringify ! ( HAINTMSK ) ));
}
impl Clone for USB_OTG_HostTypeDef {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct USB_OTG_HostChannelTypeDef {
    pub HCCHAR: u32,
    pub HCSPLT: u32,
    pub HCINT: u32,
    pub HCINTMSK: u32,
    pub HCTSIZ: u32,
    pub HCDMA: u32,
    pub Reserved: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_USB_OTG_HostChannelTypeDef() {
    assert_eq!(::core::mem::size_of::<USB_OTG_HostChannelTypeDef>() , 32usize
               , concat ! (
               "Size of: " , stringify ! ( USB_OTG_HostChannelTypeDef ) ));
    assert_eq! (::core::mem::align_of::<USB_OTG_HostChannelTypeDef>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( USB_OTG_HostChannelTypeDef )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_HostChannelTypeDef ) ) . HCCHAR
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_HostChannelTypeDef ) , "::" , stringify ! ( HCCHAR )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_HostChannelTypeDef ) ) . HCSPLT
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                USB_OTG_HostChannelTypeDef ) , "::" , stringify ! ( HCSPLT )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const USB_OTG_HostChannelTypeDef ) ) . HCINT as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
